Revit 2024 API
FamilyManager.Parameter Property
Obtains a parameter based on an identifier.
Overload List
Name | Description
Parameter[Guid]
Obtains the parameter of this type with a given GUID for a shared parameter.
Parameter[String]
Obtains the parameter of this type with a given name.
Parameter[BuiltInParameter]
Obtains the parameter of this type with a given parameter id.
Parameter[Definition]
Obtains the parameter of this type with a given definition.
See Also
FamilyManager Class
FamilyManager Members
Autodesk.Revit.DB Namespace